# GetVerbosity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDataConversionMonitor..::..GetVerbosity Method
IDataConversionMonitor Interface See Also
---
Reports requested verbosity level
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
DataExchangeMessageVerbosity GetVerbosity()
```

Visual Basic
---
```text
Function GetVerbosity As DataExchangeMessageVerbosity
```

Visual C++
---
```text
DataExchangeMessageVerbosity GetVerbosity()
```

# See Also
IDataConversionMonitor Interface
Autodesk.Revit.DB Namespace